In [1]:
print('Teste')

Teste

In [2]:
pip install pandas

Requirement already satisfied: pandas in /home/codespace/.local/lib/python3.10/site-packages (2.1.1)
Requirement already satisfied: numpy>=1.22.4 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.3 -> 23.3.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
dados = pd.read_csv('https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/base-de-dados/aluguel.csv', sep=';')

In [5]:
pd.read_csv('./data/exemplo.csv')

   coluna1   coluna2   coluna3
0        1         2         3
1        4         5         6
2        7         8         9

In [6]:
pd.('./data/tread_jsoneste.json')

   id   nome
0   1  Marco
1   2   José

In [7]:
varTeste = 20

In [8]:
dados.columns

Index(['Tipo', 'Bairro', 'Quartos', 'Vagas', 'Suites', 'Area', 'Valor',
       'Condominio', 'IPTU'],
      dtype='object')

In [9]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

In [10]:
dados['Bairro']

0                  Copacabana
1             Jardim Botânico
2             Barra da Tijuca
3                      Centro
4                Higienópolis
                 ...
32955                  Centro
32956             Jacarepaguá
32957    São Francisco Xavier
32958                  Leblon
32959                  Centro
Name: Bairro, Length: 32960, dtype: object

In [14]:
dados[['Bairro', 'Quartos']].head(20)

                     Bairro  Quartos
0                Copacabana        1
1           Jardim Botânico        2
2           Barra da Tijuca        0
3                    Centro        1
4              Higienópolis        1
5              Vista Alegre        3
6                  Cachambi        2
7           Barra da Tijuca        5
8                     Ramos        2
9                    Centro        0
10                   Centro        1
11                   Grajaú        2
12      Lins de Vasconcelos        3
13               Copacabana        1
14               Copacabana        1
15               Copacabana        4
16                 Botafogo        0
17                 Botafogo        3
18                  Taquara        3
19  Freguesia (Jacarepaguá)        3

In [15]:
pip freeze > requirements.txt

Note: you may need to restart the kernel to use updated packages.